vlm/extension/DataProcessors/бит_ЗагрузкаЗаказовНаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗагрузкаЗаказовНаПроизводство</Name>
			<Comment>ЛТ5.27</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

vlm/extension/Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СрокСдачиЗаказчику</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ДатаРасчетаСрокаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ОбщийСрокИзготовленияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_СрокИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/DataProcessors/бит_ЗагрузкаЗаказовНаПроизводство/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыбратьФайлExcel(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресТЗ", "");
	СтруктураПараметров.Вставить("АдресТЗОписанияТиповКолонок", ПолучитьАдресТЗОписанияТиповКолонок());
	СтруктураПараметров.Вставить("НомерКолонкиСДанными", НомерПервойКолонкиСДанными);
	СтруктураПараметров.Вставить("НомерСтрокиСДанными", НомерПервойСтрокиСДанными);
	СтруктураПараметров.Вставить("ОбработкаОповещения", Новый ОписаниеОповещения("ПолучитьТЗИзВременногоХранилища", ЭтотОбъект, СтруктураПараметров));
		
	бит_ОбщегоНазначенияКлиент.ВыбратьФайлExcel(СтруктураПараметров);
	
КонецПроцедуры                               

&НаСервере
Функция ПолучитьАдресТЗОписанияТиповКолонок()
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("НомерКолонки");
	ТаблицаЗначений.Колонки.Добавить("ОписаниеТипа");

	НоваяСтрокаТЗ = ТаблицаЗначений.Добавить();
	НоваяСтрокаТЗ.НомерКолонки = 5; // ТМ
	НоваяСтрокаТЗ.ОписаниеТипа = Новый ОписаниеТипов("Число", , Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный));
	
	НоваяСтрокаТЗ = ТаблицаЗначений.Добавить();
	НоваяСтрокаТЗ.НомерКолонки = 15; // Номер
	НоваяСтрокаТЗ.ОписаниеТипа = Новый ОписаниеТипов("Число", , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаЗначений, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьТЗИзВременногоХранилища(Результат, ДополнительныеПараметры) Экспорт 

	ОбработатьТаблицуЗначений(ДополнительныеПараметры.АдресТЗ);	

КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуЗначений(АдресТЗ) 
	
	ТЗ = ПолучитьИзВременногоХранилища(АдресТЗ);
	//Для каждого стр из ТЗ Цикл
	_01_ТаблицаДанных.Очистить();
	_01_ТаблицаДанных.Загрузить(ТЗ);
	
	ПолучитьКоличествоЗагруженных();
	
	Для Каждого СтрокаТЗ Из _01_ТаблицаДанных Цикл  
		СтрокаТЗ._15 = СтрЗаменить(СтрокаТЗ._15, Символ(160), "");  
		СтрокаТЗ._05 = СтрЗаменить(СтрокаТЗ._05, Символ(160), "");
		//СтрокаТЗ.бит_КлючЗагрузки = Строка(СтрокаТЗ._05) + " " + Строка(СтрокаТЗ._15);
		СтрокаТЗ.бит_КлючЗагрузки = Число(СтрокаТЗ._15);
		СтрокаТЗ._16 = СтрЗаменить(СтрокаТЗ._16, "_x000D_", "");
	КонецЦикла;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ТЗ._01 КАК ИмяКолонки
	//	|ПОМЕСТИТЬ вт_ТЗ
	//	|ИЗ
	//	|	&ТЗ КАК ТЗ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	вт_ТЗ.ИмяКолонки КАК ИмяКолонки
	//	|ИЗ
	//	|	вт_ТЗ КАК вт_ТЗ";
	//
	//Запрос.УстановитьПараметр("ТЗ", ТЗ);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	
	//			
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКоличествоЗагруженных() 
	
	КоличествоЗагружено = _01_ТаблицаДанных.Количество();
	Элементы.EXCEL.Заголовок = "EXCEL (" + Строка(КоличествоЗагружено) + ")";
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьНаСервере()
	
	
	// 01 Тип				Игнорировать столбец при переносе	система сигналов исторической системы
	// 02 ПЗ				Игнорировать столбец при переносе	система сигналов исторической системы
    // 03 Тип. план.		Игнорировать столбец при переносе	система сигналов исторической системы

	// 04 Приоритет			бит_ВидЗаказа	При загрузке данных если не подобран элемент справочника "Типизация заказов на производство", создавать новый элемент
	
	// 05 ТМ				Игнорировать столбец при переносе	система сигналов исторической системы
    // 06 Наименование		Игнорировать столбец при переносе	Старое название документа
	
	// 07 Дата открытия/запуска		Дата (Дата документа)	
    // 08 Дата закрытия				ДатаПотребности (Желаемая дата выпуска)

	// 09 ТМЦ				Номенклатура строки ТЧ "Продукция"	
	
	// 10 Характеристика	Игнорировать столбец при переносе	Рудимент использования исторической системы
	
	// 11 Подразделение		Подразделение-Диспетчер	
	
	// 12 Ед. изм.			не транслировать из файла. Брать базовую единицу измерения из "Номенклатуры"	
	
	// 13  ("Треб. кол-во"-"Сдано на склад"), если результат больше "0"	Количество строка ТЧ Продукция.	При трансляции необходимо переводить количество в базовые единицы измерения номенклатуры из Тонн. Например, результат (Треб. кол-во-Сдано на склад)= 0,1 вписывать как 100кг.
	
	// 14 Сдано на склад	Игнорировать столбец при переносе	В ERP иные механизмы контроля.

	// 15 Номер				Назначение строка ТЧ Продукция	
	//						Производится поиск назначения с типом "Заказ клиента" с реквизитом "(бит) № сделки из ККСС". 
	//						Если назначения нет - необходимо создать.

	// 16 Примечание		Комментарий	
	//						Транслировать значение из файла между фразой "Информация по заказу:" и знаком переноса на новую строку.
	//						Если между фразой "Информация по заказу:" и знаком переноса на новую строку отсутствует информация, 
	//						то комментарий остается незаполненным.


 	//Номер	Типовой механизм нумерации по порядку
    //Операция	Устанавливать значение "Собственное производство"
    //Статус	Устанавливать "К производству"
    //Приоритет	Устанавливать "Средний"
    //Спецификация	Использовать типовой подбор актуальной спецификации в "Заказ на производство"

	//Получатель Производится проверка реквизита Склад по сопоставленному заказу клиента из назначения.
	//Если значение склад пустое, то производить заполнение из настройки (бит) Значения по умолчанию - Склад готовой продукции

    //Ответственный	Пользователь запустивший обработку
	//--------------------------------------------------------------------------------------------------------------------
	// 04 Приоритет			бит_ВидЗаказа	При загрузке данных если не подобран элемент справочника "Типизация заказов на производство", создавать новый элемент
	// 07 Дата открытия/запуска		Дата (Дата документа)	
    // 08 Дата закрытия				ДатаПотребности (Желаемая дата выпуска)
    // 09 ТМЦ				Номенклатура строки ТЧ "Продукция"	
    // 11 Подразделение		Подразделение-Диспетчер
	// 13 Количество (переводить в базу из тонн)  
	// 15 Номер				Назначение строка ТЧ Продукция 
	// 16 Примечание
	//--------------------------------------------------------------------------------------------------------------------
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТЗ", _01_ТаблицаДанных.Выгрузить());
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.бит_КлючЗагрузки КАК бит_КлючЗагрузки,
	               |	ТЗ._05 КАК ТМ,
	               |	ТЗ._04 КАК ВидЗаказа,
				   //|	ТЗ._07 КАК бит_ПереданВПроизводство,
	               |	ТЗ._09 КАК Номенклатура,
	               |	ТЗ._11 КАК Подразделение,
				   //|	ТЗ._12 КАК Единица,
	               |	ТЗ._13 КАК Количество,
				   |	ТЗ._14 КАК КоличествоСдано,
	               |	ТЗ._15 КАК Назначение,
	               |	ТЗ._08 КАК ЖелаемаяДатаВыпуска,
				   //|	ТЗ._23 КАК бит_ДатаПослупленияОригДок,
				   //|	ТЗ._27 КАК НомерРаспоряжения,
				   //|	ТЗ._32 КАК ТипТары,
				   |	ТЗ._16 КАК Примечание,
	               |	ТЗ._07 КАК ДатаДокумента
	               |ПОМЕСТИТЬ вт_ТЗ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |";
	Запрос.Выполнить();                   
	
	// Проверим наличие видов заказов и если нет то создадим
	Запрос.Текст = "ВЫБРАТЬ Различные
	               |	вт_ТЗ.ВидЗаказа КАК ВидЗаказа,
	               |	бит_ТипизацияЗаказовНаПроизводство.Ссылка КАК Ссылка
	               |ИЗ
	               |	вт_ТЗ КАК вт_ТЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ТипизацияЗаказовНаПроизводство КАК бит_ТипизацияЗаказовНаПроизводство
	               |		ПО вт_ТЗ.ВидЗаказа = бит_ТипизацияЗаказовНаПроизводство.Наименование
	               |ГДЕ
	               |	бит_ТипизацияЗаказовНаПроизводство.Ссылка ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		спр = Справочники.бит_ТипизацияЗаказовНаПроизводство.СоздатьЭлемент();
		спр.Наименование = Выборка.ВидЗаказа;
		спр.Записать();
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	вт_ТЗ.ВидЗаказа КАК ВидЗаказа,
				   //|	вт_ТЗ.бит_ПереданВПроизводство КАК бит_ПереданВПроизводство,
	               |	вт_ТЗ.Номенклатура КАК Номенклатура,
	               |	вт_ТЗ.Подразделение КАК Подразделение,
				   //|	вт_ТЗ.Единица КАК Единица,
	               |	вт_ТЗ.Количество - вт_ТЗ.КоличествоСдано  КАК Количество,
	               |	вт_ТЗ.Назначение КАК Назначение,
	               |	вт_ТЗ.ЖелаемаяДатаВыпуска КАК ЖелаемаяДатаВыпуска,
				   //|	вт_ТЗ.бит_ДатаПослупленияОригДок КАК бит_ДатаПослупленияОригДок,
				   //|	вт_ТЗ.НомерРаспоряжения КАК НомерРаспоряжения,
				   //|	вт_ТЗ.ТипТары КАК ТипТары,
				   |	вт_ТЗ.Примечание КАК Примечание,
	               |	вт_ТЗ.ДатаДокумента КАК ДатаДокумента,
	               |	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	               |	НоменклатураСпр.Ссылка КАК НоменклатураСсылка,
	               |	бит_ТипизацияЗаказовНаПроизводство.Ссылка КАК ВидЗаказаСсылка,
	               |	СтруктураПредприятия.Ссылка КАК ПодразделениеСсылка,
	               |	вт_ТЗ.бит_КлючЗагрузки КАК бит_КлючЗагрузки
	               |ПОМЕСТИТЬ вт_ЗаказыКлиентов
	               |ИЗ
	               |	вт_ТЗ КАК вт_ТЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ТипизацияЗаказовНаПроизводство КАК бит_ТипизацияЗаказовНаПроизводство
	               |		ПО вт_ТЗ.ВидЗаказа = бит_ТипизацияЗаказовНаПроизводство.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	               |		ПО вт_ТЗ.Номенклатура = НоменклатураСпр.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	               |		ПО вт_ТЗ.Подразделение = СтруктураПредприятия.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ПО вт_ТЗ.бит_КлючЗагрузки = ЗаказКлиентаТовары.Ссылка.бит_ЗаказКапитал
	               |			И вт_ТЗ.Номенклатура = ЗаказКлиентаТовары.Номенклатура.Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказНаПроизводство2_2Продукция.Ссылка КАК ЗаказНаПроизводство,
	               |	вт_ЗаказыКлиентов.ЗаказКлиента КАК ЗаказКлиента,
	               |	вт_ЗаказыКлиентов.ВидЗаказа КАК ВидЗаказа,
				   //|	вт_ЗаказыКлиентов.бит_ПереданВПроизводство КАК бит_ПереданВПроизводство,
	               |	вт_ЗаказыКлиентов.Номенклатура КАК Номенклатура,
	               |	вт_ЗаказыКлиентов.Подразделение КАК Подразделение,
				   //|	вт_ЗаказыКлиентов.Единица КАК Единица,
	               |	вт_ЗаказыКлиентов.Количество КАК Количество,
	               |	вт_ЗаказыКлиентов.Назначение КАК Назначение,
	               |	вт_ЗаказыКлиентов.ЖелаемаяДатаВыпуска КАК ЖелаемаяДатаВыпуска,
				   //|	вт_ЗаказыКлиентов.бит_ДатаПослупленияОригДок КАК бит_ДатаПослупленияОригДок,
				   //|	вт_ЗаказыКлиентов.НомерРаспоряжения КАК НомерРаспоряжения,
				   //|	вт_ЗаказыКлиентов.ТипТары КАК ТипТары,
				   |	вт_ЗаказыКлиентов.Примечание КАК Примечание,
	               |	вт_ЗаказыКлиентов.ДатаДокумента КАК ДатаДокумента,
	               |	МАКСИМУМ(вт_ЗаказыКлиентов.НоменклатураСсылка) КАК НоменклатураСсылка,
	               |	вт_ЗаказыКлиентов.ВидЗаказаСсылка КАК ВидЗаказаСсылка,
	               |	вт_ЗаказыКлиентов.ПодразделениеСсылка КАК ПодразделениеСсылка,
	               |	вт_ЗаказыКлиентов.бит_КлючЗагрузки КАК бит_КлючЗагрузки,
	               |	1 КАК Поле1
	               |ПОМЕСТИТЬ вт_Итоговая
	               |ИЗ
	               |	вт_ЗаказыКлиентов КАК вт_ЗаказыКлиентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	               |		ПО вт_ЗаказыКлиентов.НоменклатураСсылка = ЗаказНаПроизводство2_2Продукция.Номенклатура
	               |			И вт_ЗаказыКлиентов.ЗаказКлиента = ЗаказНаПроизводство2_2Продукция.Назначение.Заказ
	               |			И (НЕ ЗаказНаПроизводство2_2Продукция.Ссылка.ПометкаУдаления)
	               |ГДЕ
	               |	НЕ вт_ЗаказыКлиентов.ЗаказКлиента ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
				   //|	вт_ЗаказыКлиентов.бит_ПереданВПроизводство,
	               |	вт_ЗаказыКлиентов.бит_КлючЗагрузки,
				   //|	вт_ЗаказыКлиентов.Единица,
	               |	вт_ЗаказыКлиентов.ВидЗаказаСсылка,
	               |	вт_ЗаказыКлиентов.Номенклатура,
	               |	вт_ЗаказыКлиентов.ПодразделениеСсылка,
	               |	вт_ЗаказыКлиентов.ВидЗаказа,
				   |	вт_ЗаказыКлиентов.Примечание,
	               |	ЗаказНаПроизводство2_2Продукция.Ссылка,
	               |	вт_ЗаказыКлиентов.Подразделение,
	               |	вт_ЗаказыКлиентов.ЖелаемаяДатаВыпуска,
	               |	вт_ЗаказыКлиентов.ДатаДокумента,
				   //|	вт_ЗаказыКлиентов.бит_ДатаПослупленияОригДок,
				   //|	вт_ЗаказыКлиентов.ТипТары,
	               |	вт_ЗаказыКлиентов.Назначение,
	               |	вт_ЗаказыКлиентов.Количество,
	               |	вт_ЗаказыКлиентов.ЗаказКлиента
				   //|	вт_ЗаказыКлиентов.НомерРаспоряжения
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаказНаПроизводство2_2Продукция.Ссылка,
	               |	вт_ЗаказыКлиентов.ЗаказКлиента,
	               |	вт_ЗаказыКлиентов.ВидЗаказа,
				   //|	вт_ЗаказыКлиентов.бит_ПереданВПроизводство,
	               |	вт_ЗаказыКлиентов.Номенклатура,
	               |	вт_ЗаказыКлиентов.Подразделение,
				   //|	вт_ЗаказыКлиентов.Единица,
	               |	вт_ЗаказыКлиентов.Количество,
	               |	вт_ЗаказыКлиентов.Назначение,
	               |	вт_ЗаказыКлиентов.ЖелаемаяДатаВыпуска,
				   //|	вт_ЗаказыКлиентов.бит_ДатаПослупленияОригДок,
				   //|	вт_ЗаказыКлиентов.НомерРаспоряжения,
				   //|	вт_ЗаказыКлиентов.ТипТары,
				   |	вт_ЗаказыКлиентов.Примечание,
	               |	вт_ЗаказыКлиентов.ДатаДокумента,
	               |	МАКСИМУМ(вт_ЗаказыКлиентов.НоменклатураСсылка),
	               |	вт_ЗаказыКлиентов.ВидЗаказаСсылка,
	               |	вт_ЗаказыКлиентов.ПодразделениеСсылка,
	               |	вт_ЗаказыКлиентов.бит_КлючЗагрузки,
	               |	2
	               |ИЗ
	               |	вт_ЗаказыКлиентов КАК вт_ЗаказыКлиентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	               |		ПО вт_ЗаказыКлиентов.НоменклатураСсылка = ЗаказНаПроизводство2_2Продукция.Номенклатура
	               |			И вт_ЗаказыКлиентов.бит_КлючЗагрузки = ЗаказНаПроизводство2_2Продукция.Ссылка.бит_КлючЗагрузки
	               |			И (НЕ ЗаказНаПроизводство2_2Продукция.Ссылка.ПометкаУдаления)
	               |ГДЕ
	               |	вт_ЗаказыКлиентов.ЗаказКлиента ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	вт_ЗаказыКлиентов.Подразделение,
	               |	вт_ЗаказыКлиентов.ВидЗаказа,
				   //|	вт_ЗаказыКлиентов.ТипТары,
	               |	вт_ЗаказыКлиентов.Назначение,
				   //|	вт_ЗаказыКлиентов.бит_ПереданВПроизводство,
	               |	ЗаказНаПроизводство2_2Продукция.Ссылка,
	               |	вт_ЗаказыКлиентов.ДатаДокумента,
	               |	вт_ЗаказыКлиентов.бит_КлючЗагрузки,
	               |	вт_ЗаказыКлиентов.ПодразделениеСсылка,
				   //|	вт_ЗаказыКлиентов.НомерРаспоряжения,
				   //|	вт_ЗаказыКлиентов.Единица,
	               |	вт_ЗаказыКлиентов.Номенклатура,
	               |	вт_ЗаказыКлиентов.ЖелаемаяДатаВыпуска,
				   //|	вт_ЗаказыКлиентов.бит_ДатаПослупленияОригДок,
	               |	вт_ЗаказыКлиентов.ВидЗаказаСсылка,
				   |	вт_ЗаказыКлиентов.Примечание,
	               |	вт_ЗаказыКлиентов.ЗаказКлиента,
	               |	вт_ЗаказыКлиентов.Количество
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт_Итоговая.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	               |	вт_Итоговая.ЗаказКлиента КАК ЗаказКлиента,
	               |	вт_Итоговая.ВидЗаказа КАК _04,
				   //|	вт_Итоговая.бит_ПереданВПроизводство КАК _07,
	               |	вт_Итоговая.Номенклатура КАК _09,
	               |	вт_Итоговая.Подразделение КАК _11,
				   //|	вт_Итоговая.Единица КАК _12,
	               |	вт_Итоговая.Количество КАК _13,
	               |	вт_Итоговая.Назначение КАК _15,
	               |	вт_Итоговая.ЖелаемаяДатаВыпуска КАК _08,
				   //|	вт_Итоговая.бит_ДатаПослупленияОригДок КАК _23,
				   //|	вт_Итоговая.НомерРаспоряжения КАК _27,
				   //|	вт_Итоговая.ТипТары КАК _32,
				   |	вт_Итоговая.Примечание КАК _16,
	               |	вт_Итоговая.ДатаДокумента КАК _07,
	               |	вт_Итоговая.НоменклатураСсылка КАК НоменклатураСсылка,
	               |	вт_Итоговая.ВидЗаказаСсылка КАК ВидЗаказаСсылка,
	               |	вт_Итоговая.ПодразделениеСсылка КАК ПодразделениеСсылка,
	               |	вт_Итоговая.бит_КлючЗагрузки КАК бит_КлючЗагрузки,
	               |	вт_Итоговая.Поле1 КАК Поле1
	               |ИЗ
	               |	вт_Итоговая КАК вт_Итоговая
	               |ГДЕ
	               |	вт_Итоговая.ЗаказНаПроизводство ЕСТЬ NULL
	               |	И НЕ вт_Итоговая.НоменклатураСсылка ЕСТЬ NULL
	               |	И НЕ вт_Итоговая.ВидЗаказаСсылка ЕСТЬ NULL
	               |	И НЕ вт_Итоговая.ПодразделениеСсылка ЕСТЬ NULL
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаказКлиента УБЫВ,
	               |	бит_КлючЗагрузки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт_Итоговая.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	               |	вт_Итоговая.ЗаказКлиента КАК ЗаказКлиента,
	               |	вт_Итоговая.ВидЗаказа КАК _04,
				   //|	вт_Итоговая.бит_ПереданВПроизводство КАК _07,
	               |	вт_Итоговая.Номенклатура КАК _09,
	               |	вт_Итоговая.Подразделение КАК _11,
				   //|	вт_Итоговая.Единица КАК _12,
	               |	вт_Итоговая.Количество КАК _13,
	               |	вт_Итоговая.Назначение КАК _15,
	               |	вт_Итоговая.ЖелаемаяДатаВыпуска КАК _08,
				   //|	вт_Итоговая.бит_ДатаПослупленияОригДок КАК _23,
				   //|	вт_Итоговая.НомерРаспоряжения КАК _27,
				   //|	вт_Итоговая.ТипТары КАК _32,
				   |	вт_Итоговая.Примечание КАК _16,
	               |	вт_Итоговая.ДатаДокумента КАК _07,
	               |	вт_Итоговая.НоменклатураСсылка КАК НоменклатураСсылка,
	               |	вт_Итоговая.ВидЗаказаСсылка КАК ВидЗаказаСсылка,
	               |	вт_Итоговая.ПодразделениеСсылка КАК ПодразделениеСсылка,
	               |	вт_Итоговая.бит_КлючЗагрузки КАК бит_КлючЗагрузки
	               |ИЗ
	               |	вт_Итоговая КАК вт_Итоговая
	               |ГДЕ
	               |	вт_Итоговая.ЗаказНаПроизводство <> ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	бит_КлючЗагрузки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт_Итоговая.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	               |	вт_Итоговая.ЗаказКлиента КАК ЗаказКлиента,
	               |	вт_Итоговая.ВидЗаказа КАК _04,
				   //|	вт_Итоговая.бит_ПереданВПроизводство КАК _07,
	               |	вт_Итоговая.Номенклатура КАК _09,
	               |	вт_Итоговая.Подразделение КАК _11,
				   //|	вт_Итоговая.Единица КАК _12,
	               |	вт_Итоговая.Количество КАК _13,
	               |	вт_Итоговая.Назначение КАК _15,
	               |	вт_Итоговая.ЖелаемаяДатаВыпуска КАК _08,
				   //|	вт_Итоговая.бит_ДатаПослупленияОригДок КАК _23,
				   //|	вт_Итоговая.НомерРаспоряжения КАК _27,
				   //|	вт_Итоговая.ТипТары КАК _32,
				   |	вт_Итоговая.Примечание КАК _16,
	               |	вт_Итоговая.ДатаДокумента КАК _07,
	               |	вт_Итоговая.НоменклатураСсылка КАК НоменклатураСсылка,
	               |	вт_Итоговая.ВидЗаказаСсылка КАК ВидЗаказаСсылка,
	               |	вт_Итоговая.ПодразделениеСсылка КАК ПодразделениеСсылка,
	               |	вт_Итоговая.бит_КлючЗагрузки КАК бит_КлючЗагрузки
	               |ИЗ
	               |	вт_Итоговая КАК вт_Итоговая
	               |ГДЕ
	               |	(вт_Итоговая.НоменклатураСсылка ЕСТЬ NULL
	               |			ИЛИ вт_Итоговая.ВидЗаказаСсылка ЕСТЬ NULL
	               |			ИЛИ вт_Итоговая.ПодразделениеСсылка ЕСТЬ NULL)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидЗаказаСсылка,
	               |	ПодразделениеСсылка,
	               |	НоменклатураСсылка,
	               |	бит_КлючЗагрузки";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();

	Создаваемые =  РезультатЗапроса[2].Выгрузить();
	Проверяемые =  РезультатЗапроса[3].Выгрузить();
	Ошибки =  РезультатЗапроса[4].Выгрузить();
	
	_02_ТаблицаДанных_Создаваемые.Очистить();	
	_03_ТаблицаДанных_Проверяемые.Очистить();
	_04_ТаблицаДанных_Ошибки.Очистить();
	
	_02_ТаблицаДанных_Создаваемые.Загрузить(Создаваемые);
	_03_ТаблицаДанных_Проверяемые.Загрузить(Проверяемые);
	_04_ТаблицаДанных_Ошибки.Загрузить(Ошибки);
	
	КоличествоНовых = _02_ТаблицаДанных_Создаваемые.Количество();
	КоличествоСозданых = _03_ТаблицаДанных_Проверяемые.Количество();
	КоличествоОшибок = _04_ТаблицаДанных_Ошибки.Количество();
	
	КоличествоРазница = ?(КоличествоЗагружено - КоличествоНовых - КоличествоСозданых - КоличествоОшибок = 0, 0, КоличествоЗагружено - КоличествоНовых - КоличествоСозданых - КоличествоОшибок);
	
	Элементы.Группа1.ТекущаяСтраница = Элементы.Создаваемые;
	
	Элементы.Создаваемые.Заголовок = "Создаваемые (" + Строка(КоличествоНовых) + ")";
	Элементы.Проверяемые.Заголовок = "Проверяемые (" + Строка(КоличествоСозданых) + ")";
	Элементы.Ошибки.Заголовок = "Ошибки (" + Строка(КоличествоОшибок) + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура Сопоставить(Команда)   
	
	СопоставитьНаСервере();
	
	Если КоличествоРазница <> 0 тогда
		Элементы._02_ТаблицаДанных_СоздаваемыеСоздатьЭлементы.Доступность = Ложь;
		Элементы._03_ТаблицаДанных_ПроверяемыеПерезаписатьЭлементы.Доступность = Ложь;
		Сообщить("Необходимо устранить разницу между загруженными и создаваемыми/записываемыми элементами!");
	Иначе
		Элементы._02_ТаблицаДанных_СоздаваемыеСоздатьЭлементы.Доступность = Истина;
		Элементы._03_ТаблицаДанных_ПроверяемыеПерезаписатьЭлементы.Доступность = Истина;
	КонецЕсли;                         
	
	тзЗаказыБезСпецификаций.Очистить();
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыНаСервере()
	
	Тонны = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("168");
	
	Для Каждого СтрокаТЗ Из _02_ТаблицаДанных_Создаваемые Цикл
		// проверим чтобы количество было > 0          
		//Если СтрокаТЗ._13 = "" Тогда
			колВоТребуется = СтрокаТЗ._13;
		//Иначе
		//	колВоТребуется = Число(СтрЗаменить(СтрокаТЗ._13, ",", "."));
		//КонецЕсли;
		//Если СтрокаТЗ._14 = "" Тогда
		//	СданоНаСклад = 0;
		//Иначе
		//	СданоНаСклад = Число(СтрЗаменить(СтрокаТЗ._14, ",", "."));
		//КонецЕсли;
		
		//КоличествоВЗаказе =  колВоТребуется - СданоНаСклад;
		
		Если колВоТребуется <= 0 Тогда
			Продолжить;
		КонецЕсли;
		//ОбработкаПрерыванияПользователя();
		
		//Если ЗначениеЗаполнено(СтрокаТЗ._23) и ЗначениеЗаполнено(СтрокаТЗ.ЗаказКлиента) Тогда
		//	ЗаказКлиентаОбъект = СтрокаТЗ.ЗаказКлиента.ПолучитьОбъект();
		//	ЗаказКлиентаОбъект.бит_ДатаПоступленияОригиналовДокументов = Дата(СтрокаТЗ._23 + " 00:00:00");
		//	ЗаказКлиентаОбъект.Записать();
		//КонецЕсли;
		
		НовыйДокумент = Документы.ЗаказНаПроизводство2_2.СоздатьДокумент();
		
		НовыйДокумент.Организация = Справочники.Организации.ПолучитьОрганизациюПоУмолчанию();
		НовыйДокумент.ЗаказПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		НовыйДокумент.СпособРаспределенияЗатратНаВыходныеИзделия = Перечисления.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоДолямСтоимости;
				
		НовыйДокумент.бит_КлючЗагрузки = СтрокаТЗ.бит_КлючЗагрузки;
		
		НовыйДокумент.Статус = Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству;
		НовыйДокумент.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
		НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СобственноеПроизводство;
		
		НовыйДокумент.ТипПроизводственногоПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Сборка;
		
		НовыйДокумент.НачатьНеРанее = Дата(СтрокаТЗ._07 + " 00:00:00");
		НовыйДокумент.РазмещениеВыпуска = Перечисления.СпособыПривязкиОперацийПроизводства.КНачалу;
		
		НовыйДокумент.Дата = Дата(СтрокаТЗ._07 + " 00:00:00");
		
		НовыйДокумент.Подразделение = СтрокаТЗ.ПодразделениеСсылка;
		НовыйДокумент.бит_ВидЗаказа = СтрокаТЗ.ВидЗаказаСсылка;
		
		//НовыйДокумент.бит_ПереданВПроизводство = Дата(СтрокаТЗ._07 + " 00:00:00");
		НовыйДокумент.ДатаПотребности = Дата(СтрокаТЗ._08 + " 00:00:00");
		
		СтрокаПродукция = НовыйДокумент.Продукция.Добавить();
		СтрокаПродукция.Номенклатура = СтрокаТЗ.НоменклатураСсылка; 
		СтрокаПродукция.Назначение = ПолучитьНазначение(СтрокаТЗ.ЗаказКлиента);   
		Коэф = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(Тонны, СтрокаПродукция.Номенклатура); 
		СтрокаПродукция.КоличествоУпаковок = Коэф * колВоТребуется;
		СтрокаПродукция.Количество = СтрокаПродукция.КоличествоУпаковок;
		СтрокаПродукция.Склад = СтрокаТЗ.ЗаказКлиента.Склад;
		
		Если ЗначениеЗаполнено(СтрокаТЗ.ЗаказКлиента.Склад) Тогда
			СтрокаПродукция.Склад =	СтрокаТЗ.ЗаказКлиента.Склад;
		Иначе	
			СтрокаПродукция.Склад = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СкладГотовойПродукции, ЭтотОбъект, Истина);
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(СтрокаТЗ.ЗаказКлиента) Тогда
		//	СтрокаПродукция.бит_ТипТары = СтрокаТЗ.ЗаказКлиента.Товары[0].бит_ТипТары;
		//	СтрокаПродукция.бит_КоличествоТары = СтрокаТЗ.ЗаказКлиента.Товары[0].бит_КоличествоТары;
		//КонецЕсли;
		
		СтрокаПродукция.Спецификация = ПолучитьОсновнуюСпецификацию(СтрокаПродукция.Номенклатура, НовыйДокумент.Дата);
		
		НовыйДокумент.Комментарий = ПолучитьПримечание(СтрокаТЗ._16);
		НовыйДокумент.Ответственный = Пользователи.АвторизованныйПользователь();
		
		Попытка
			НовыйДокумент.ДинамическаяСтруктура = Истина;
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 
			
			// динамическое планирование
			//ЗаказНаПроизводство = НовыйДокумент.Ссылка;   
			//Документы.ЗаказНаПроизводство2_2.ПротоколРасчетаСтруктурыЗаказа(ЗаказНаПроизводство);
			//// расчет динамического планирования	
			//ПлюсПятьСекунд = ТекущаяДатаСеанса() + 20;                      
			//Результат = Документы.ЗаказНаПроизводство2_2.ПротоколРасчетаСтруктурыЗаказа(ЗаказНаПроизводство);
			//Пока Результат.Состояние <> 1 Или ТекущаяДатаСеанса() <= ПлюсПятьСекунд Цикл
			//	Результат = Документы.ЗаказНаПроизводство2_2.ПротоколРасчетаСтруктурыЗаказа(ЗаказНаПроизводство);
			//КонецЦикла;
						//------------------------------
			Запись = РегистрыСведений.бит_ПереносЗаказовНаПроизводство.СоздатьМенеджерЗаписи();
			Запись.ЗаказНаПроизводство = НовыйДокумент.Ссылка;
			Запись.ДатаЗагрузки = ТекущаяДатаСеанса();
			Запись.Пользователь = Пользователи.АвторизованныйПользователь();
			Запись.НомерЗаказа = НовыйДокумент.Номер;
			
			Запись.Записать(Истина);
			
		Исключение
			НовыйДокумент.Записать();
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		Если Не ЗначениеЗаполнено(СтрокаПродукция.Спецификация) Тогда
			новСтрокаЗаказ = тзЗаказыБезСпецификаций.Добавить();
			новСтрокаЗаказ.ЗаказНаПроизводство = НовыйДокумент.Ссылка;
			элементы.СтраницаЗаказыБезСпецификаций.Заголовок = СтрШаблон("(%1) Заказы без спецификаций", тзЗаказыБезСпецификаций.Количество());
		КонецЕсли;
	КонецЦикла;
	
	_02_ТаблицаДанных_Создаваемые.Очистить();
	
    //Дата(Дата + " 00:00:00");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПримечание(Знач ТекстПримечания)
	// Транслировать значение из файла между фразой "Информация по заказу:" и знаком переноса на новую строку.
	// Если между фразой "Информация по заказу:" и знаком переноса на новую строку отсутствует информация, то комментарий остается незаполненным.	
	НачПоз = СтрНайти(ТекстПримечания, "Информация по заказу:") + 21; // 21 это длина искомого текста "Информация по заказу:"
	Если НачПоз = 0 Тогда
		Примечание = "";
	Иначе
		Примечание = Сред(ТекстПримечания, НачПоз);
		
		КонПоз = СтрНайти(Примечание, Символы.ПС);
		Если КонПоз <> 0 Тогда
			Примечание = Лев(Примечание, КонПоз);
		КонецЕсли;   
		Примечание = СтрЗаменить(Примечание, "_x000D_", "");
	КонецЕсли;
	
	Возврат Примечание;
	
КонецФункции

&НаСервере
Функция ПолучитьНазначение(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Назначения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Назначения КАК Назначения
		|ГДЕ
		|	Назначения.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура СоздатьЭлементы(Команда)
	СоздатьЭлементыНаСервере();
	Сообщить("Выполнено!");
КонецПроцедуры

&НаСервере
Функция ПолучитьОсновнуюСпецификацию(Номенклатура, НачалоПроизводства)
	
	ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыВыбораСпецификаций();
	ПараметрыВыбораСпецификаций.Вставить("ПолучитьСпецификацииПоНоменклатуре", Истина);
	ПараметрыВыбораСпецификаций.Вставить("ПолучитьСпецификацииПоСпискуНоменклатуры", Ложь);
	ПараметрыВыбораСпецификаций.Вставить("ИгнорируемыеПараметрыНазначения", Новый Массив);
	ПараметрыВыбораСпецификаций.Вставить("ИгнорируемыеУточненияПрименения", Новый Массив);
	
	ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СтруктураДанныхОбИзделииДляВыбораСпецификации();
	ДанныеОбИзделии.Номенклатура = Номенклатура;	
	ДанныеОбИзделии.НачалоПроизводства = НачалоПроизводства;
	
	Результат = УправлениеДаннымиОбИзделиях.СпецификацииИзделия(ДанныеОбИзделии, ПараметрыВыбораСпецификаций);
	
	ИсключитьСпецификацию = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	
	Спецификации             = Новый Массив;
	ПриоритетнаяСпецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	
	Для Индекс = 0 По Результат.ВГраница() Цикл
		ТекущаяСпецификация = Результат[Индекс].Спецификация;
		Если ПриоритетнаяСпецификация.Пустая()
				И Результат[Индекс].ПодбираетсяАвтоматически = Истина Тогда
			ПриоритетнаяСпецификация = ТекущаяСпецификация;
		КонецЕсли;
		Если ТекущаяСпецификация <> ИсключитьСпецификацию Тогда
			Спецификации.Добавить(ТекущаяСпецификация);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ПриоритетнаяСпецификация;
	
КонецФункции

&НаСервере
Процедура ПерезаписатьЭлементыНаСервере()
	
	Тонны = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("168");

	Для Каждого СтрокаТЗ Из _03_ТаблицаДанных_Проверяемые Цикл
		//
		//Если ЗначениеЗаполнено(СтрокаТЗ._23) и ЗначениеЗаполнено(СтрокаТЗ.ЗаказКлиента) Тогда
		//	ЗаказКлиентаОбъект = СтрокаТЗ.ЗаказКлиента.ПолучитьОбъект();
		//	ЗаказКлиентаОбъект.бит_ДатаПоступленияОригиналовДокументов = Дата(СтрокаТЗ._23 + " 00:00:00");
		//	ЗаказКлиентаОбъект.Записать();
		//КонецЕсли;
		Если СтрокаТЗ._13 <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйДокумент = СтрокаТЗ.ЗаказНаПроизводство.ПолучитьОбъект();
		
		НовыйДокумент.Продукция.Очистить();
		
		НовыйДокумент.Статус = Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству;
		НовыйДокумент.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
		НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СобственноеПроизводство;
		
		НовыйДокумент.ТипПроизводственногоПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Сборка;
		
		НовыйДокумент.НачатьНеРанее = Дата(СтрокаТЗ._07 + " 00:00:00");
		НовыйДокумент.РазмещениеВыпуска = Перечисления.СпособыПривязкиОперацийПроизводства.КНачалу;
		
		НовыйДокумент.Дата = Дата(СтрокаТЗ._07 + " 00:00:00");
		НовыйДокумент.Подразделение = СтрокаТЗ.ПодразделениеСсылка;
		НовыйДокумент.бит_ВидЗаказа = СтрокаТЗ.ВидЗаказаСсылка;
		//НовыйДокумент.получатель
		
		//НовыйДокумент.бит_ПереданВПроизводство = Дата(СтрокаТЗ._07 + " 00:00:00");
		НовыйДокумент.ДатаПотребности = Дата(СтрокаТЗ._08 + " 00:00:00");
		
		СтрокаПродукция = НовыйДокумент.Продукция.Добавить();
		СтрокаПродукция.Номенклатура = СтрокаТЗ.НоменклатураСсылка; 
		СтрокаПродукция.Назначение = ПолучитьНазначение(СтрокаТЗ.ЗаказКлиента); 
		Коэф = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(Тонны, СтрокаПродукция.Номенклатура); 
		СтрокаПродукция.КоличествоУпаковок = Коэф * СтрокаТЗ._13;
		СтрокаПродукция.Количество = СтрокаПродукция.КоличествоУпаковок;
		СтрокаПродукция.Склад = СтрокаТЗ.ЗаказКлиента.Склад;
		
		Если ЗначениеЗаполнено(СтрокаТЗ.ЗаказКлиента.Склад) Тогда
			СтрокаПродукция.Склад =	СтрокаТЗ.ЗаказКлиента.Склад;
		Иначе	
			СтрокаПродукция.Склад = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СкладГотовойПродукции, ЭтотОбъект, Истина);
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(СтрокаТЗ.ЗаказКлиента) Тогда
		//	СтрокаПродукция.бит_ТипТары = СтрокаТЗ.ЗаказКлиента.Товары[0].бит_ТипТары;
		//	СтрокаПродукция.бит_КоличествоТары = СтрокаТЗ.ЗаказКлиента.Товары[0].бит_КоличествоТары;
		//КонецЕсли;
	
		СтрокаПродукция.Спецификация = ПолучитьОсновнуюСпецификацию(СтрокаПродукция.Номенклатура, НовыйДокумент.Дата);
		
		НовыйДокумент.Комментарий = ПолучитьПримечание(СтрокаТЗ._16);
		НовыйДокумент.Ответственный = Пользователи.АвторизованныйПользователь();
		
		Попытка
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
			Запись = РегистрыСведений.бит_ПереносЗаказовНаПроизводство.СоздатьМенеджерЗаписи();
			Запись.ЗаказНаПроизводство = НовыйДокумент.Ссылка;
			Запись.ДатаЗагрузки = ТекущаяДатаСеанса();
			Запись.Пользователь = Пользователи.АвторизованныйПользователь();
			Запись.НомерЗаказа = НовыйДокумент.Номер;
			
			Запись.Записать(Истина);
			
		Исключение
			НовыйДокумент.Записать();
			Сообщить(ОписаниеОшибки());
		КонецПопытки;                
		
	КонецЦикла;
	
	_03_ТаблицаДанных_Проверяемые.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаписатьЭлементы(Команда) 
	
	ПерезаписатьЭлементыНаСервере();
	Сообщить("Выполнено!");  
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	НомерПервойКолонкиСДанными = 1;
	НомерПервойСтрокиСДанными = 2;
	
КонецПроцедуры


&НаКлиенте
Процедура _01_ТаблицаДанныхПослеУдаления(Элемент)

	ПолучитьКоличествоЗагруженных();

КонецПроцедуры
